Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: [0113] The target base station and the source base station may be different base stations, or may be a same base station.
de_de: [0113] Die Zielbasisstation und die Quellbasisstation können unterschiedliche Basisstationen sein oder können eine gleiche Basisstation sein.

source: The following uses an example in which the target base station and the source base station are different base stations for description.
de_de: Im Folgenden wird ein Beispiel verwendet, in dem die Zielbasisstation und die Quellbasisstation zur Beschreibung unterschiedliche Basisstationen sind.

source: For a case in which the target base station and the source base station are a same base station, only an interaction operation between the source base station and the target base station needs to be omitted.
de_de: Für einen Fall, in dem die Zielbasisstation und die Quellbasisstation eine gleiche Basisstation sind, muss nur eine Interaktionsoperation zwischen der Quellbasisstation und der Zielbasisstation weggelassen werden.

source: [0114] FIG. 3 shows a connection resume request method according to this application.
de_de: [0114] FIG. 3 zeigt ein Verbindungswiederaufnahmeanforderungsverfahren gemäß dieser Anmeldung.

source: The method includes the following steps.
de_de: Das Verfahren beinhaltet die folgenden Schritte.

source: [0115] Step 301: A terminal generates a message authentication code (message authentication code, MAC).
de_de: [0115] Schritt 301: Ein Endgerät erzeugt einen Nachrichtenauthentifizierungscode (Message Authentication Code, MAC).

source: [0116] The message authentication code is used to authenticate validity of the terminal. During specific implementation, the message authentication code is generated in at least the following two manners:
de_de: [0116] Der Nachrichtenauthentifizierungscode wird verwendet, um die Gültigkeit des Endgeräts zu authentifizieren. Während der spezifischen Implementierung wird der Nachrichtenauthentifizierungscode auf mindestens die folgenden zwei Arten erzeugt:

source: [0117] Manner 1: Generate the message authentication code based on an integrity protection algorithm of the terminal and an integrity protection key of the terminal, where the integrity protection key is the same as an integrity protection key used in previous resume.
de_de: [0117] Art 1: Erzeugen des Nachrichtenauthentifizierungscodes basierend auf einem Integritätsschutzalgorithmus des Endgeräts und einem Integritätsschutzschlüssel des Endgeräts, wobei der Integritätsschutzschlüssel der gleiche ist wie ein Integritätsschutzschlüssel, der in der vorherigen Fortsetzung verwendet wurde.

source: [0118] In the manner 1, an integrity protection key used by the terminal to generate a message authentication code each time is the same as an integrity protection key used in the previous resume.
de_de: [0118] In der Art 1 ist ein Integritätsschutzschlüssel, der von dem Endgerät verwendet wird, um jedes Mal einen Nachrichtenauthentifizierungscode zu erzeugen, der gleiche wie ein Integritätsschutzschlüssel, der in der vorherigen Fortsetzung verwendet wurde.

source: Correspondingly, an integrity protection key of the terminal stored in a source base station is also the same as an integrity protection key used in the previous resume.
de_de: Dementsprechend ist ein Integritätsschutzschlüssel des Endgeräts, der in einer Quellbasisstation gespeichert ist, auch der gleiche wie ein Integritätsschutzschlüssel, der in der vorherigen Fortsetzung verwendet wurde.

source: [0119] For example, Krrc-int is used to represent the integrity protection key of the terminal. If other parameters for generating the message authentication code are also the same, the message authentication code generated by the terminal each time is the same, that is, is generated based on Krrc-int and the integrity protection algorithm of the terminal.
de_de: [0119] Zum Beispiel wird Krrc-int verwendet, um den Integritätsschutzschlüssel des Endgeräts darzustellen. Falls andere Parameter zum Erzeugen des Nachrichtenauthentifizierungscodes auch die gleichen sind, ist der Nachrichtenauthentifizierungscode, der durch das Endgerät jedes Mal erzeugt wird, der gleiche, das heißt, er wird basierend auf Krrc-int und dem Integritätsschutzalgorithmus des Endgeräts erzeugt.

source: [0120] Krrc-int is generated by the terminal based on an access stratum key, an identifier of the integrity protection algorithm of the terminal, and a type of the integrity protection algorithm of the terminal. Therefore, in the manner 1, that the integrity protection key Krrc-int of the terminal is the same as the integrity protection key used in the previous resume may also be understood as that the access stratum key of the terminal is the same as an access stratum key used in the previous resume.
de_de: [0120] Krrc-int wird durch das Endgerät basierend auf einem Zugriffsschichtschlüssel, einer Kennung des Integritätsschutzalgorithmus des Endgeräts und einem Typ des Integritätsschutzalgorithmus des Endgeräts erzeugt. Daher kann in der Weise 1, dass der Integritätsschutzschlüssel Krrc-int des Endgeräts der gleiche wie der Integritätsschutzschlüssel ist, der in der vorherigen Fortsetzung verwendet wird, auch verstanden werden, dass der Zugriffsschichtschlüssel des Endgeräts der gleiche wie ein Zugriffsschichtschlüssel ist, der in der vorherigen Fortsetzung verwendet wird.

source: [0121] For example, if KgNB is used to represent the access stratum key, in the manner 1, the access stratum key KgNB used when the terminal generates the message authentication code remains the same as the access stratum key used in the previous resume.
de_de: [0121] Wenn zum Beispiel KgNB verwendet wird, um den Zugriffsschichtschlüssel darzustellen, bleibt in der Weise 1 der Zugriffsschichtschlüssel KgNB, der verwendet wird, wenn das Endgerät den Nachrichtenauthentifizierungscode erzeugt, der gleiche wie der Zugriffsschichtschlüssel, der in der vorherigen Fortsetzung verwendet wird.

source: [0122] Manner 2: Generate the message authentication code based on the integrity protection algorithm of the terminal and the integrity protection key of the terminal, where the integrity protection key is regenerated.
de_de: [0122] Weise 2: Erzeugen des Nachrichtenauthentifizierungscodes basierend auf dem Integritätsschutzalgorithmus des Endgeräts und dem Integritätsschutzschlüssel des Endgeräts, wobei der Integritätsschutzschlüssel regeneriert wird.

source: [0123] In the manner 2, the integrity protection key used by the terminal when the terminal generates the message authentication code each time is regenerated, and is different from an integrity protection key used by the terminal at a previous time.
de_de: [0123] In der Weise 2 ist der Integritätsschutzschlüssel, der von dem Endgerät verwendet wird, wenn das Endgerät den Nachrichtenauthentifizierungscode jedes Mal erzeugt, regeneriert und unterscheidet sich von einem Integritätsschutzschlüssel, der von dem Endgerät zu einem vorherigen Zeitpunkt verwendet wurde.

source: [0124] For example, if the integrity protection key used by the terminal at the previous time is Krrc-int, the terminal needs to regenerate and use a new integrity protection key, for example, use Krrc-int* to represent the new integrity protection key.
de_de: [0124] Wenn beispielsweise der Integritätsschutzschlüssel, der von dem Endgerät zu dem vorherigen Zeitpunkt verwendet wurde, Krrc-int ist, muss das Endgerät regenerieren und einen neuen Integritätsschutzschlüssel verwenden, beispielsweise Krrc-int* verwenden, um den neuen Integritätsschutzschlüssel darzustellen.

source: [0125] In an implementation, the terminal may generate the new integrity protection key Krrc-int* by using the following method: generating, by the terminal, a new access stratum key, and then generating Krrc-int* by using the new access stratum key, an identifier of the integrity protection algorithm of the terminal, and a type of the integrity protection algorithm of the terminal.
de_de: [0125] In einer Implementierung kann das Endgerät den neuen Integritätsschutzschlüssel Krrc-int* unter Verwendung des folgenden Verfahrens erzeugen: Erzeugen eines neuen Zugriffsschichtschlüssels durch das Endgerät und dann Erzeugen von Krrc-int* unter Verwendung des neuen Zugriffsschichtschlüssels, einer Kennung des Integritätsschutzalgorithmus des Endgeräts und eines Typs des Integritätsschutzalgorithmus des Endgeräts.

source: [0126] For example, if KgNB is used to represent a current access stratum key of the terminal, and KgNB* is used to represent a new access stratum key, in the manner 2, the terminal generates Krrc-int* based on KgNB*, the identifier of the integrity protection algorithm of the terminal, and the type of the integrity protection algorithm of the terminal, and then generates the message authentication code by using Krrc-int* and the integrity protection algorithm of the terminal.
de_de: [0126] Wenn beispielsweise KgNB verwendet wird, um einen aktuellen Zugriffsschichtschlüssel des Endgeräts darzustellen, und KgNB* verwendet wird, um einen neuen Zugriffsschichtschlüssel darzustellen, erzeugt das Endgerät auf die Weise 2 Krrc-int* basierend auf KgNB*, der Kennung des Integritätsschutzalgorithmus des Endgeräts und dem Typ des Integritätsschutzalgorithmus des Endgeräts und erzeugt dann den Nachrichtenauthentifizierungscode unter Verwendung von Krrc-int* und des Integritätsschutzalgorithmus des Endgeräts.

source: [0127] Because the new access stratum key KgNB* is used, a finally generated message authentication code changes.
de_de: [0127] Da der neue Zugriffsschichtschlüssel KgNB* verwendet wird, ändert sich ein schließlich erzeugter Nachrichtenauthentifizierungscode.

source: That is, each time the terminal needs to use the message authentication code, the generated message authentication code is different from a message authentication code that is generated at a previous time.
de_de: Das heißt, jedes Mal, wenn das Endgerät den Nachrichtenauthentifizierungscode verwenden muss, unterscheidet sich der erzeugte Nachrichtenauthentifizierungscode von einem Nachrichtenauthentifizierungscode, der zu einem vorherigen Zeitpunkt erzeugt wurde.

source: [0128] In an example, the following describes a method for generating a new access stratum key KgNB*, and the method includes the following steps.
de_de: [0128] In einem Beispiel beschreibt das Folgende ein Verfahren zum Erzeugen eines neuen Zugriffsschichtschlüssels KgNB*, und das Verfahren umfasst die folgenden Schritte.

source: [0129] Step A1: A terminal obtains a first NCC and a second NCC.
de_de: [0129] Schritt A1: Ein Endgerät erhält einen ersten NCC und einen zweiten NCC.

source: [0130] The first NCC is an NCC that is sent by a source base station to the terminal in a suspend procedure of the terminal and that is stored by the terminal. For details, refer to step 202.
de_de: [0130] Der erste NCC ist ein NCC, der von einer Quellbasisstation an das Endgerät in einer Aussetzungsprozedur des Endgeräts gesendet wird und der von dem Endgerät gespeichert wird. Für Einzelheiten siehe Schritt 202.

source: [0131] The second NCC is an NCC stored before the terminal obtains the first NCC.
de_de: [0131] Der zweite NCC ist ein NCC, der gespeichert wird, bevor das Endgerät den ersten NCC erhält.

source: [0132] Step A2: The terminal determines whether the first NCC is the same as the second NCC.
de_de: [0132] Schritt A2: Das Endgerät bestimmt, ob der erste NCC der gleiche wie der zweite NCC ist.

source: If the first NCC is the same as the second NCC, step A3 is performed, or if the first NCC is different from the second NCC, step A4 is performed.
de_de: Wenn der erste NCC der gleiche wie der zweite NCC ist, wird Schritt A3 durchgeführt, oder wenn sich der erste NCC von dem zweiten NCC unterscheidet, wird Schritt A4 durchgeführt.

source: [0133] Step A3: The terminal obtains KgNB* based on KgNB.
de_de: [0133] Schritt A3: Das Endgerät erhält KgNB* basierend auf KgNB.

source: [0134] KgNB refers to an old access stratum key (old KgNB), and may also be referred to as an original access stratum key (original KgNB), or may also be referred to as a previous access stratum key (old KgNB).
de_de: [0134] KgNB bezieht sich auf einen alten Zugriffsschichtschlüssel (alter KgNB) und kann auch als ein ursprünglicher Zugriffsschichtschlüssel (ursprünglicher KgNB) bezeichnet werden oder kann auch als ein vorheriger Zugriffsschichtschlüssel (alter KgNB) bezeichnet werden.

source: [0135] Correspondingly, KgNB* is a new access stratum key (new KgNB), and may also be referred to as an updated access stratum key (updated KgNB).
de_de: [0135] Entsprechend ist KgNB* ein neuer Zugriffsschichtschlüssel (neuer KgNB) und kann auch als ein aktualisierter Zugriffsschichtschlüssel (aktualisierter KgNB) bezeichnet werden.

source: [0136] It should be noted that KgNB and KgNB* are merely symbolized representations.
de_de: [0136] Es sei darauf hingewiesen, dass KgNB und KgNB* lediglich symbolische Darstellungen sind.

source: For example, in a 4G application, the access stratum key may be represented by KeNB or KeNB*.
de_de: Zum Beispiel kann in einer 4G-Anwendung der Zugriffsschichtschlüssel durch KeNB oder KeNB* dargestellt werden.

source: Different representation forms used by a symbol do not constitute a limitation on this application.
de_de: Unterschiedliche Darstellungsformen, die durch ein Symbol verwendet werden, stellen keine Einschränkung dieser Anwendung dar.

source: [0137] Optionally, in an implementation, in step A3, the terminal may obtain KgNB* based on KgNB, a target physical cell identifier (physical cell identifier, PCI), and an absolute radio frequency channel number-downlink (absolute radio frequency channel number-down link, ARFCN-DL).
de_de: [0137] Optional kann das Endgerät in einer Implementierung in Schritt A3 den KgNB* basierend auf dem KgNB, einer physischen Zielzellenkennung (Physical Cell Identifier, PCI) und einer absoluten Funkfrequenzkanalnummer-Downlink (Absolute Radio Frequency Channel Number-Down Link, ARFCN-DL) erhalten.

source: [0138] A specific implementation of obtaining KgNB* based on KgNB, the target PCI, and the ARFCN-DL is the prior art. For this, refer to related documents.
de_de: [0138] Eine spezifische Implementierung des Erhaltens des KgNB* basierend auf dem KgNB, der Ziel-PCI und der ARFCN-DL ist Stand der Technik.

source: For example, refer to related descriptions in the 3rd generation partnership project (3rd generation partnership project, 3GPP) technical specification (technical specification, TS) 33.401 or 3GPP TS 33.501.
de_de: Es sei zum Beispiel auf zugehörige Beschreibungen in der technischen Spezifikation (technische Spezifikation, TS) 33,401 oder 3GPP TS 33,501 des Partnerschaftsprojekts der 3. Generation (3rd generation partnership project, 3GPP) hingewiesen.

source: Details are not described herein.
de_de: Details sind hierin nicht beschrieben.

source: [0139] Step A4: The terminal obtains a next hop (next hop, NH) based on the first NCC and the second NCC, and obtains KgNB* based on the NH.
de_de: [0139] Schritt A4: Das Endgerät erhält einen nächsten Hop (Next Hop, NH) basierend auf dem ersten NCC und dem zweiten NCC und erhält KgNB* basierend auf dem NH.

source: [0140] The NH has a correspondence with the first NCC and the second NCC.
de_de: [0140] Das NH korrespondiert mit dem ersten NCC und dem zweiten NCC.

source: The terminal may determine a quantity N of times for which derivation is performed on the NH based on the first NCC and the second NCC, then obtain a next NH through derivation performed on a current NH, and obtain another NH through derivation performed by using the next NH. This process is repeated until derivation is performed for N times, to obtain a final NH.
de_de: Das Endgerät kann eine Anzahl N von Malen bestimmen, für die eine Ableitung an dem NH basierend auf dem ersten NCC und dem zweiten NCC durchgeführt wird, dann ein nächstes NH durch Ableitung erhalten, die an einem aktuellen NH durchgeführt wird, und ein weiteres NH durch Ableitung erhalten, die unter Verwendung des nächsten NH durchgeführt wird. Dieser Prozess wird wiederholt, bis die Ableitung für N Male durchgeführt wird, um ein endgültiges NH zu erhalten.

source: [0141] Optionally, in an implementation, the terminal may obtain KgNB* based on NH, the target PCI, and the ARFCN-DL.
de_de: [0141] Optional kann das Endgerät in einer Implementierung KgNB* basierend auf NH, dem Ziel-PCI und dem ARFCN-DL erhalten.

source: [0142] A specific implementation of generating KgNB* is the prior art. For this, refer to related documents.
de_de: [0142] Eine spezifische Implementierung des Erzeugens von KgNB* ist Stand der Technik. Dazu sei auf damit im Zusammenhang stehende Dokumente hingewiesen.

source: For example, refer to related descriptions in 3GPP TS 33.401 or 3GPP TS 33.501.
de_de: Zum Beispiel sei auf damit im Zusammenhang stehende Beschreibungen bei 3GPP TS 33.401 oder 3GPP TS 33.501 hingewiesen.

source: [0143] Optionally, after obtaining the integrity protection key in the foregoing two manners, the terminal may generate the message authentication code based on the integrity protection key, a source PCI, a source cell radio network temporary identifier (cell radio network temporary identifier, C-RNTI), a target cell identifier, and a resume constant.
de_de: [0143] Optional kann das Endgerät nach dem Erhalten des Integritätsschutzschlüssels auf die vorstehenden zwei Weisen den Nachrichtenauthentifizierungscode basierend auf dem Integritätsschutzschlüssel, einer Quellen-PCI, einer temporären Quellen-Zellenfunknetzkennung (temporären Zellenfunknetzkennung, C-RNTI), einer Zielzellenkennung und einer Wiederaufnahmekonstante erzeugen.

source: [0144] In conclusion, a main difference between the foregoing manner 1 and manner 2 lies in that in the manner 1, each time the terminal uses the message authentication code, the generated message authentication code is the same as the message authentication code that is generated at the previous time, that is, the message authentication code remains unchanged, and in the manner 2, each time the terminal uses the message authentication code, the generated message authentication code is different from the message authentication code that is generated at the previous time, that is, the message authentication code keeps being updated.
de_de: [0144] Zusammenfassend liegt ein Hauptunterschied zwischen der vorstehenden Weise 1 und der Weise 2 darin, dass in der Weise 1 jedes Mal, wenn das Endgerät den Nachrichtenauthentifizierungscode verwendet, der erzeugte Nachrichtenauthentifizierungscode der gleiche wie der Nachrichtenauthentifizierungscode ist, der zum vorherigen Zeitpunkt erzeugt wurde, d. h. der Nachrichtenauthentifizierungscode bleibt unverändert, und in der Weise 2 jedes Mal, wenn das Endgerät den Nachrichtenauthentifizierungscode verwendet, der erzeugte Nachrichtenauthentifizierungscode sich von dem Nachrichtenauthentifizierungscode unterscheidet, der zum vorherigen Zeitpunkt erzeugt wurde, d. h. der Nachrichtenauthentifizierungscode wird weiterhin aktualisiert.

source: [0145] Step 302: The terminal sends a connection resume request message to a target base station, and the target base station receives the connection resume request message from the terminal.
de_de: [0145] Schritt 302: Das Endgerät sendet eine Verbindungswiederaufnahmeanforderungsnachricht an eine Zielbasisstation, und die Zielbasisstation empfängt die Verbindungswiederaufnahmeanforderungsnachricht vom Endgerät.

source: [0146] The connection resume request message sent by the terminal is used to request to resume an RRC connection.
de_de: [0146] Die vom Endgerät gesendete Verbindungswiederaufnahmeanforderungsnachricht wird verwendet, um die Wiederaufnahme einer RRC-Verbindung anzufordern.

source: That is, the terminal requests to resume from an inactive state to a connected state.
de_de: Das heißt, das Endgerät fordert die Wiederaufnahme von einem inaktiven Zustand in einen verbundenen Zustand an.

source: [0147] In an implementation, the connection resume request message carries a resume identifier.
de_de: [0147] In einer Implementierung trägt die Verbindungswiederaufnahmeanforderungsnachricht eine Wiederaufnahmekennung.

source: The resume identifier is sent by the source base station to the terminal when the terminal enters the inactive state from the connected state.
de_de: Die Wiederaufnahmekennung wird durch die Quellbasisstation an das Endgerät gesendet, wenn das Endgerät aus dem verbundenen Zustand in den inaktiven Zustand eintritt.

source: For example, refer to related descriptions of step 202.
de_de: Es sei zum Beispiel auf zugehörige Beschreibungen von Schritt 202 hingewiesen.

source: Details are not described herein again.
de_de: Details werden hierin nicht erneut beschrieben.

source: [0148] Further, the connection resume request message further carries the message authentication code generated in step 301.
de_de: [0148] Ferner führt die Verbindungswiederaufnahmeanforderungsnachricht ferner den in Schritt 301 erzeugten Nachrichtenauthentifizierungscode.

source: [0149] Step 303: The target base station determines whether to accept the resume request of the terminal.
de_de: [0149] Schritt 303: Die Zielbasisstation bestimmt, ob die Wiederaufnahmeanforderung des Endgeräts akzeptiert werden soll.

source: [0150] The target base station determines, based on a load capability, whether the terminal can access the target base station.
de_de: [0150] Die Zielbasisstation bestimmt basierend auf einer Lastfähigkeit, ob das Endgerät auf die Zielbasisstation zugreifen kann.

source: [0151] In one case, if the target base station has relatively heavy load and cannot be accessed by the terminal, the target base station may reject the resume request of the terminal, that is, reject access by the terminal to the target base station.
de_de: [0151] In einem Fall, wenn die Zielbasisstation eine relativ hohe Last aufweist und auf die das Endgerät nicht zugreifen kann, kann die Zielbasisstation die Wiederaufnahmeanforderung des Endgeräts zurückweisen, das heißt, den Zugriff des Endgeräts auf die Zielbasisstation zurückweisen.

source: In this case, step 304 is performed.
de_de: In diesem Fall wird Schritt 304 durchgeführt.

source: [0152] In another case, the target base station does not have very heavy load and may further be accessed by the terminal. In this case, the target base station may accept the resume request of the terminal, that is, agree to access by the terminal to the target base station.
de_de: [0152] In einem anderen Fall weist die Zielbasisstation keine sehr hohe Last auf und es kann ferner durch das Endgerät darauf zugegriffen werden. In diesem Fall kann die Zielbasisstation die Wiederaufnahmeanforderung des Endgeräts akzeptieren, das heißt, dem Zugriff durch das Endgerät auf die Zielbasisstation zustimmen.

source: In this case, step 305 to step 308 are performed.
de_de: In diesem Fall werden die Schritte 305 bis 308 durchgeführt.

source: [0153] Step 304: The target base station sends a connection resume rejection message to the terminal, and the terminal receives the connection resume rejection message from the target base station.
de_de: [0153] Schritt 304: Die Zielbasisstation sendet eine Verbindungswiederaufnahmeablehnungsnachricht an das Endgerät, und das Endgerät empfängt die Verbindungswiederaufnahmeablehnungsnachricht von der Zielbasisstation.
